# Tips python

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Selección de datos
#### Utilizando Numpy para crear una serie y luego seleccionamos por indice LABEL o indice ENTERO

In [2]:
enserio = Series(np.arange(5), index=["Fila 1","Fila 2","Fila 3","Fila 4","Fila 5"])
enserio

Fila 1    0
Fila 2    1
Fila 3    2
Fila 4    3
Fila 5    4
dtype: int32

#####  para seleccionar un dato en base a un indice LABEL

In [3]:
enserio["Fila 5"]

4

######  para seleccionar toda la fila en base a su indice ENTERO

In [4]:
enserio[[1,4]]

Fila 2    1
Fila 5    4
dtype: int32

In [5]:
# para tener los mismos números aleatorios
np.random.seed(25)

#  Aqui estas aplicando los métodos uno a uno
#datafreim=np.random.rand(16)
#datafreimR = np.reshape(datafreim,(4,4))
#datafreimRD = DataFrame(datafreimR)
#datafreimRD

# Aquí estas aplicando el reshape directamente sobre el array y luego lo conviertes a Data frame
datafreim=DataFrame(np.random.rand(16).reshape((4,4)),index=["Fila 1","Fila 2","Fila 3","Fila 4",],
                                                      columns=["Col 1","Col 2","Col 3","Col 4",])
datafreim

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839  0.185911
Fila 2  0.411100  0.117376  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366  0.113041
Fila 4  0.447031  0.585445  0.161985  0.520719

###### para hacer un slice con loc

In [6]:
datafreim.loc["Fila 1":"Fila 3"]

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839  0.185911
Fila 2  0.411100  0.117376  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366  0.113041

##### Comparamos con un escalar

In [7]:
datafreim > 0.2

        Col 1  Col 2  Col 3  Col 4
Fila 1   True   True   True  False
Fila 2   True  False   True   True
Fila 3   True   True   True  False
Fila 4   True   True  False   True

######  podemos filtrar con ese criterio, cachas no ve?

In [8]:
datafreimConNAN =datafreim[datafreim > 0.2]

#####  ahora vamos a asignar oe

In [9]:
datafreim.loc["Fila 2","Col 2"]=7
datafreim

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839  0.185911
Fila 2  0.411100  7.000000  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366  0.113041
Fila 4  0.447031  0.585445  0.161985  0.520719

#####  Podemos tratar los campos NaN (Not a Number) o missing data asi:

In [10]:
datafreimConNAN

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839       NaN
Fila 2  0.411100       NaN  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366       NaN
Fila 4  0.447031  0.585445       NaN  0.520719

In [11]:
datafreimConNAN.isnull()

        Col 1  Col 2  Col 3  Col 4
Fila 1  False  False  False   True
Fila 2  False   True  False  False
Fila 3  False  False  False   True
Fila 4  False  False   True  False

#####  Aqui estas reshenando los datos faltontos con el dato de adelante, cachas no ve perro?

In [12]:
datafreimConNAN.fillna(method ="bfill")

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839  0.437611
Fila 2  0.411100  0.367080  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366  0.520719
Fila 4  0.447031  0.585445       NaN  0.520719

######  Rellenando con el promedio de esa colunga

In [13]:
datafreimConNAN.fillna(datafreimConNAN["Col 4"].mean())

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839  0.479165
Fila 2  0.411100  0.479165  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366  0.479165
Fila 4  0.447031  0.585445  0.479165  0.520719

######  ahora borramos los datos faltantes

In [14]:
datafreimConNAN

           Col 1     Col 2     Col 3     Col 4
Fila 1  0.870124  0.582277  0.278839       NaN
Fila 2  0.411100       NaN  0.684969  0.437611
Fila 3  0.556229  0.367080  0.402366       NaN
Fila 4  0.447031  0.585445       NaN  0.520719

In [15]:
# Aqui borramos las filas que tiene NaN
datafreimConNAN.dropna()

Empty DataFrame
Columns: [Col 1, Col 2, Col 3, Col 4]
Index: []

In [16]:
# Aqui borramos las columnas que tienen NaN
datafreimConNAN.dropna(axis =1)

           Col 1
Fila 1  0.870124
Fila 2  0.411100
Fila 3  0.556229
Fila 4  0.447031

#### Para detectar duplicados y borrarlos seeee

In [38]:
duplicados=DataFrame({"A":[1,1,3,3],
                      "B":["x","x","z","z"]})
# si no pones nada en el parentesis, encuentra de todo el DataFrame oe, pero te muestra de qué registros
#duplicados.duplicated("A")
duplicados.duplicated()

0    False
1     True
2    False
3     True
dtype: bool

In [42]:
# Borramos duplicados
sinduplicados= duplicados.drop_duplicates()
sinduplicados

   A  B
0  1  x
2  3  z